using System;
using System.Collections.Generic;
using System.Linq;

using NUnit.Framework;

namespace Lab_03.Core.Tests
{
    public class CipherTextTests
    {
        [Test]
        public void Test1()
        {
            var c = new VigenereDecrypter("я хочу, пицу!".ToUpper());

            Assert.That(c.CipherTextOriginal, Is.EqualTo("я хочу, пицу!".ToUpper()));
            Assert.That(c.CipherTextOnlyLetters, Is.EqualTo("яхочупицу".ToUpper()));

            Assert.That(c.TextOnlyLetters, Is.EqualTo("имогугиху".ToUpper()));

            Assert.That(c.Text, Is.EqualTo("и могу, гиху!".ToUpper()));

            c.Key = "АБВ";
        }

        [Test]
        public void TestSample1()
        {
            var c = new VigenereDecrypter("ВЙИИОЗР");

            c.Key = "АБВ";


            Assert.That(c.Text, Is.EqualTo("ВИЖЕНЕР"));
        }

        [Test]
        public void Test1Var()
        {
            var t =
                "ЦЬЦЬИУЯ БОЫАОУШ ЛЙЦ ГЧЙДРЫУШ Х ЧЦХОШАТС, ЕЪЬЫЬЫНШВЦЧ ЪСУЩШУ: НЯУАОФОЧЦ М СЩЧЬНУСБХЦЦ РСТ ПЮЫАЗ ЬЦМСМОЦОХБ ГКПЦМИЕИПЩЗЫТЦИТМ, ЬЬТЖЖКФРЫМКВ, НЦМШМС ЕШЮЖРТС ЕЪЦМЩММЮЬКЬН ЕУБПУ Х ЭФНЖШТР. \"ЯРУИЪЦ, МЮДЧ, - ЩШРЩЮМР ЫЦБ ШУ ФЕЭ ПСЩ ЭФУКПЯЬЬФ, - Ш ИППК УХЧТ ЬОЦОСЧ; ЩЪУГЫТ ЖЙОУЭ, УХРЮ ЬЙ РСТ ФДНБМЦЬБ. ГШ АЖ ЫЙЧЫЪЭРЩМЗ. ИППК ЬИТД БАЩ-ЫМЖЙОК ТОРЕГТА, ЩТСУ НЬЬ-ШЦЕШЪЖ АРПЙ ФДХММЦЦЦХ - ЬЙ УЪ ЛЕГЙА, Л ЭФУНПУ Ю АЙЖХ ОЮКЫА, ФЖШЕРУ ЦКЧП ЫУЭТЬЫЦ, АЖ БК Н ЩХНПУЦБ ГК ЫРСТ ТЫ ЯЬВУЬБ. ЗЦЬЭЮМ, ЬИШП УХ ЦКЧЙ ЫР РЯЭЫХ ЪЩТСАЯ РЦНЬУНЗПД. Ю АЙЖХ Т АРЭЙХТ ЭФР ЕЦУ-ИШ ЫЛЕМТЦИА ЬЩМЭАШЪ МЬНПД ФЮУЕДЧТ ФЮЛЯОН. ЖТЯЮЫТП Й ЬУМН СК ЗЬЮЩС, Д ФДОЕЛЯ М ЗДМЯР ЯПЕЧ, ХЦШЦГ ТЫ МЦПЫД; ЧС ЭФ ОЬСДЫВКЬН ЛЕ ВШТШЙР УЗМУДУСНЫЦ, ХЛ АЙС, НЬЬ МКЙЧ ГК ЭРЮЖАЫ НЩЛХД. ЦВШАЫЦ, ОЕА ЪОТ ЭТФЦОУГК Ж ЕГНЩУЧХПЮУ ЮЩТ. ЕКЖПСУЯА; ЧЫЛН ЮФ СЕНТЫЛУЦ ЦШПА ЭНСШИЖ; БС Н ЖНЬЭ Б ЭУЕД ЮЧЬФ ЮДМ ГК ЖРУ ЭКЩШЩЗЯОУЯ ЩЩЛАТП, ОХНЪО Х РДЫШЩЪ... ТТД СОЧОСЬЮМЬ, ЧЬКТД ЩБЬАМЧТЫН ЪЦХЕИЖ ЪЩТСАЫ ФОЫАМТАТ, ЭЩЮЦХЫЬЦХЦ ЛЕ ЪПЫЗСМ. ЙЦ МУПК СЕ УЬЬЧ СЧЖЮЬЯК, О СК ЖКХНУФЧСМОРАХД ИКЩЛЫЦ. ЧЫЪЭУ. ЬЕЙЙЦЙНОН ЗЗЙШЮМ ФЕЧШАЮ, ПФУЗЖ ЗРСТРТЫАНЬ - УШЗЬК УГ СЕЧТЮЛМЦ ЙЖЭСУУ ИКГЖСУ. АЖУЫ ША ЭУЕД ГП БФТЙЧ\". ЕЪЬЯУХЦДЪ ПЖЩ ТЧНКЯЭЦ УХЦМ. ЦШЬЗЙЦ ЯЬЭУПУЗЖ, АЩЕСУ, ГКЖРЪЧ ЪЙОЬСЫМПЙ ФБЭЫЧЧТ, ГУОЬПБГЭАЗ - ЯПУШШЪ, ХЬЙ-ИЪП ЭЩШДМЦЬК ЬРТГ ВШЩЩТТЦИЖ. ЫЩ ЭФН ШЫУЧ АТС ДЧ ЪЩС ЖМХЬК ШОИ ЦДЛЬЙ РПЕЗЬК. НЮЙСЫЧОЧЦ ТТ ВШС ЪЬЛЕЧЕАЗ РХК, ЕЪЦШНЖЭЮЫК ТО ОНЗЬК, У ЬЦХСМОЦЯГ УИ ЧУР ЫЙ НГКЕР, ШДП ДЬ ЭЫУОХЦЫЫЩСТ ФЖПЮНОСТДНЬ ЬЫД. ЗАЭЯ РСТ ХЦСРУРДРЗЙ ХЛЪЙЧГШ. УДУ СК ЕШЫУЪДР ДЧ РЬУН ИБЭПУЫЯ ХЦЮОИЩГ, ТД ЭФР БЖРЫФОЦЯГ ЖСЫАЫЬН, ЭЮЪЬХЬН ПЮЫАЗМ ЗЗЮОО, ЩЯЦЕГКРЦЦЖЕБЫН ЪУФКЪ ЩЬЫАФКИКЪУ АМЫЮКЫЛ, РТЦЛТЗЛЩХД КХОЧОСЙМКЪУ. УЭК ЕШАРЪСКШВЦФ ЬЕРЮФ, ЬМЩЙПЦИЗУЧ ХЧЦЪЙР ШДХИТЫЖ, ЫЙ ЗЫЫК ЬЬЬКБ ЩЮРТ СНВ; ЧЬ ЩЫ ЧЛЫ ЩЮЩХФКШКЩ Н ЫМЪ АШУ-ВАТ, ЪДЬН НЫЧЧЖПЫШЬ СК ЗШСЦОЬЕБЫН Ь ЭФУКПЯЬЬФУВ, БАЩПЯ ЦИКЮУЫСАЫ ЦОЬАЙХЦ ЬОХ ЫЙЙДЫНООЙСД ЭЖЦЦ ТЧ ГКЯ; РЪЧ ПЦСОЦЬХБ ЪКФР, ЕЦУ ЪПРКАСЕЪАОЭЙН ЗЫФ ШЩУ Ж ЬЫЦ ХШОЫНИПЩЗЫТ НЛ ШЭРЮЙЙЮХ, ЕЭЬ УУЪЪОСОСНЫ ЩЮУЮТЙЫ ФОХ-АТ ЦЪПЩЛЩТЦТ ЬУЪУФБ ХЪЕР, ФМЗЫП, ПЦЦКК; ЗХЬНЬР, УГ ОБЧОП З УЬЬЧ ЯПШНКУ ЭОО, ПЦФ ТЮЪДКИ ЦЬЦЬИУЗЬК, ЮФЙ ФДЫАУСЬЕХ ФЬР-ЕЦУ Ю ББНЯЦЗЙИЗЛН БЧД М СЩЮИУВ МЫЮАФКГЧУЧ ЯТМГКЫУЦ. МТДНТЛ ЯЦЕГШРУЩТЦТ ПЪЮ ТТЦЦОЫЩ, ШТИЪК ЬШ РМЙЫХ, ШЛШ ЛЕЫСФУЧ КНШШЭУЯЙЫ, КЪОШДЧМ ЮХЦ ШУРКМ, ТЫЩСИЕ ЪКФР РТЗЗП ЫР ФМЗДЩЫЬУЪ ФД ЩЮУХЖЕГЖМ, ЩТСУЯ ЬЬЦКОУ ЕЪЦНЙЫТДУ ХЛЪДЭАШЧ, МЬНПДЫАЗМ ОНЗЬЦ У НФПДЫАЗМ ОХЦЫЬХ ЭФУЮСРЩТМР ШЫУЩПЭНЯ ВБЧ Ц ХПЦЩЩУРДР ЗППР РРНЩ ОУШУКТСУ ШЛЭМЧЦХ";

            var an = new VigenereAnalysis(t);

            var pm = an.PossibleMus();

            an.SuggestMu(pm.First());
            an.SuggestMostOccuring(0, 'О');
            an.SuggestMostOccuring(1, 'О');
            an.SuggestMostOccuring(2, 'Е');
            an.SuggestMostOccuring(3, 'О');
            an.SuggestMostOccuring(4, 'О');
            an.SuggestMostOccuring(5, 'О');
            an.SuggestMostOccuring(6, 'О');
        }

        [Test]
        public void TestTrigrams()
        {
            var t =
                "ЦЬЦЬИУЯ БОЫАОУШ ЛЙЦ ГЧЙДРЫУШ Х ЧЦХОШАТС, ЕЪЬЫЬЫНШВЦЧ ЪСУЩШУ: НЯУАОФОЧЦ М СЩЧЬНУСБХЦЦ РСТ ПЮЫАЗ ЬЦМСМОЦОХБ ГКПЦМИЕИПЩЗЫТЦИТМ, ЬЬТЖЖКФРЫМКВ, НЦМШМС ЕШЮЖРТС ЕЪЦМЩММЮЬКЬН ЕУБПУ Х ЭФНЖШТР. \"ЯРУИЪЦ, МЮДЧ, - ЩШРЩЮМР ЫЦБ ШУ ФЕЭ ПСЩ ЭФУКПЯЬЬФ, - Ш ИППК УХЧТ ЬОЦОСЧ; ЩЪУГЫТ ЖЙОУЭ, УХРЮ ЬЙ РСТ ФДНБМЦЬБ. ГШ АЖ ЫЙЧЫЪЭРЩМЗ. ИППК ЬИТД БАЩ-ЫМЖЙОК ТОРЕГТА, ЩТСУ НЬЬ-ШЦЕШЪЖ АРПЙ ФДХММЦЦЦХ - ЬЙ УЪ ЛЕГЙА, Л ЭФУНПУ Ю АЙЖХ ОЮКЫА, ФЖШЕРУ ЦКЧП ЫУЭТЬЫЦ, АЖ БК Н ЩХНПУЦБ ГК ЫРСТ ТЫ ЯЬВУЬБ. ЗЦЬЭЮМ, ЬИШП УХ ЦКЧЙ ЫР РЯЭЫХ ЪЩТСАЯ РЦНЬУНЗПД. Ю АЙЖХ Т АРЭЙХТ ЭФР ЕЦУ-ИШ ЫЛЕМТЦИА ЬЩМЭАШЪ МЬНПД ФЮУЕДЧТ ФЮЛЯОН. ЖТЯЮЫТП Й ЬУМН СК ЗЬЮЩС, Д ФДОЕЛЯ М ЗДМЯР ЯПЕЧ, ХЦШЦГ ТЫ МЦПЫД; ЧС ЭФ ОЬСДЫВКЬН ЛЕ ВШТШЙР УЗМУДУСНЫЦ, ХЛ АЙС, НЬЬ МКЙЧ ГК ЭРЮЖАЫ НЩЛХД. ЦВШАЫЦ, ОЕА ЪОТ ЭТФЦОУГК Ж ЕГНЩУЧХПЮУ ЮЩТ. ЕКЖПСУЯА; ЧЫЛН ЮФ СЕНТЫЛУЦ ЦШПА ЭНСШИЖ; БС Н ЖНЬЭ Б ЭУЕД ЮЧЬФ ЮДМ ГК ЖРУ ЭКЩШЩЗЯОУЯ ЩЩЛАТП, ОХНЪО Х РДЫШЩЪ... ТТД СОЧОСЬЮМЬ, ЧЬКТД ЩБЬАМЧТЫН ЪЦХЕИЖ ЪЩТСАЫ ФОЫАМТАТ, ЭЩЮЦХЫЬЦХЦ ЛЕ ЪПЫЗСМ. ЙЦ МУПК СЕ УЬЬЧ СЧЖЮЬЯК, О СК ЖКХНУФЧСМОРАХД ИКЩЛЫЦ. ЧЫЪЭУ. ЬЕЙЙЦЙНОН ЗЗЙШЮМ ФЕЧШАЮ, ПФУЗЖ ЗРСТРТЫАНЬ - УШЗЬК УГ СЕЧТЮЛМЦ ЙЖЭСУУ ИКГЖСУ. АЖУЫ ША ЭУЕД ГП БФТЙЧ\". ЕЪЬЯУХЦДЪ ПЖЩ ТЧНКЯЭЦ УХЦМ. ЦШЬЗЙЦ ЯЬЭУПУЗЖ, АЩЕСУ, ГКЖРЪЧ ЪЙОЬСЫМПЙ ФБЭЫЧЧТ, ГУОЬПБГЭАЗ - ЯПУШШЪ, ХЬЙ-ИЪП ЭЩШДМЦЬК ЬРТГ ВШЩЩТТЦИЖ. ЫЩ ЭФН ШЫУЧ АТС ДЧ ЪЩС ЖМХЬК ШОИ ЦДЛЬЙ РПЕЗЬК. НЮЙСЫЧОЧЦ ТТ ВШС ЪЬЛЕЧЕАЗ РХК, ЕЪЦШНЖЭЮЫК ТО ОНЗЬК, У ЬЦХСМОЦЯГ УИ ЧУР ЫЙ НГКЕР, ШДП ДЬ ЭЫУОХЦЫЫЩСТ ФЖПЮНОСТДНЬ ЬЫД. ЗАЭЯ РСТ ХЦСРУРДРЗЙ ХЛЪЙЧГШ. УДУ СК ЕШЫУЪДР ДЧ РЬУН ИБЭПУЫЯ ХЦЮОИЩГ, ТД ЭФР БЖРЫФОЦЯГ ЖСЫАЫЬН, ЭЮЪЬХЬН ПЮЫАЗМ ЗЗЮОО, ЩЯЦЕГКРЦЦЖЕБЫН ЪУФКЪ ЩЬЫАФКИКЪУ АМЫЮКЫЛ, РТЦЛТЗЛЩХД КХОЧОСЙМКЪУ. УЭК ЕШАРЪСКШВЦФ ЬЕРЮФ, ЬМЩЙПЦИЗУЧ ХЧЦЪЙР ШДХИТЫЖ, ЫЙ ЗЫЫК ЬЬЬКБ ЩЮРТ СНВ; ЧЬ ЩЫ ЧЛЫ ЩЮЩХФКШКЩ Н ЫМЪ АШУ-ВАТ, ЪДЬН НЫЧЧЖПЫШЬ СК ЗШСЦОЬЕБЫН Ь ЭФУКПЯЬЬФУВ, БАЩПЯ ЦИКЮУЫСАЫ ЦОЬАЙХЦ ЬОХ ЫЙЙДЫНООЙСД ЭЖЦЦ ТЧ ГКЯ; РЪЧ ПЦСОЦЬХБ ЪКФР, ЕЦУ ЪПРКАСЕЪАОЭЙН ЗЫФ ШЩУ Ж ЬЫЦ ХШОЫНИПЩЗЫТ НЛ ШЭРЮЙЙЮХ, ЕЭЬ УУЪЪОСОСНЫ ЩЮУЮТЙЫ ФОХ-АТ ЦЪПЩЛЩТЦТ ЬУЪУФБ ХЪЕР, ФМЗЫП, ПЦЦКК; ЗХЬНЬР, УГ ОБЧОП З УЬЬЧ ЯПШНКУ ЭОО, ПЦФ ТЮЪДКИ ЦЬЦЬИУЗЬК, ЮФЙ ФДЫАУСЬЕХ ФЬР-ЕЦУ Ю ББНЯЦЗЙИЗЛН БЧД М СЩЮИУВ МЫЮАФКГЧУЧ ЯТМГКЫУЦ. МТДНТЛ ЯЦЕГШРУЩТЦТ ПЪЮ ТТЦЦОЫЩ, ШТИЪК ЬШ РМЙЫХ, ШЛШ ЛЕЫСФУЧ КНШШЭУЯЙЫ, КЪОШДЧМ ЮХЦ ШУРКМ, ТЫЩСИЕ ЪКФР РТЗЗП ЫР ФМЗДЩЫЬУЪ ФД ЩЮУХЖЕГЖМ, ЩТСУЯ ЬЬЦКОУ ЕЪЦНЙЫТДУ ХЛЪДЭАШЧ, МЬНПДЫАЗМ ОНЗЬЦ У НФПДЫАЗМ ОХЦЫЬХ ЭФУЮСРЩТМР ШЫУЩПЭНЯ ВБЧ Ц ХПЦЩЩУРДР ЗППР РРНЩ ОУШУКТСУ ШЛЭМЧЦХ";


            var ca = new VigenereAnalysis(t);

            var s1 = Enumerable.Range(0, ca.VigenereDecrypter.CipherTextOnlyLetters.Length / 7)
                .Select(i => ca.VigenereDecrypter.CipherTextOnlyLetters.Substring(i * 7, 7));
            //.Append(ca.VigenereDecrypter.CipherTextOnlyLetters.Substring(ca.VigenereDecrypter.CipherTextOnlyLetters.Length - ca.VigenereDecrypter.CipherTextOnlyLetters.Length % 7));

            var d1 = Enumerable.Range(0, 7)
                .Select(p => s1.Select(i => i[p])
                    .Aggregate(new Dictionary<char, int>(),
                        (charcouner, c) =>
                        {
                            charcouner[c] = charcouner.ContainsKey(c) ? charcouner[c] + 1 : 1;
                            return charcouner;
                        })
                    .OrderByDescending(pair => pair.Value))
                .ToList();


            var t1 = String.Join("\n", s1);

            var tr = ca.Subgrams(3);

            var order = tr.OrderByDescending(pair => pair.Value.Count());

            var mu = order
                .Where(pair => pair.Value.Count() >= 2)
                .Select(pair => VigenereAnalysis.MuFromIndeces(pair.Value))
                .Distinct()
                .Where(a => 1 < a && a < 10)
                .OrderByDescending(a => a)
                .ToList();


            var o1 = ca
                .Subgrams(2)
                .Select(g => new {Value = g, Mu = g.Value.Count() >= 2 ? VigenereAnalysis.MuFromIndeces(g.Value) : -1})
                .OrderByDescending(pair => pair.Mu)
                .ToList();

            var gj1 = Enumerable.Range(2, 9)
                .GroupJoin(o1, i => i, o => o.Mu, (i, enumerable) => (i, enumerable.Count())).ToList();
        }

        [Test]
        public void TestVar14()
        {
            var v14 =
                "Й ЯБЭТТКО АЛ ТЗХШЛУТМ ЩЮЪУККШЬЫШЖ ЧТВУШПЛЙ ЭШЧФОХМЭФ ЩОФЮГФБЕ Ы ИЫСХЕЪЮЯ. ЮТЛХХГ ЗЕЛ ЫЮХЛЪШПЭАБУ НПЬШЬ М ПШЫАФЦ СЦЛДСП ВЫХЦФ ЗТШУБ ЧХОМР. ШЯП С ОТУКААЬШЮЛЬНПУБ ИШЗЪРДШК, С ЬЮЦФ ЫЧКБЕСТВШУБ ИЪЕЦХАО, М КШВБЦШЕ ЪГДЧФИУ ЦЫИПТ ЧР ЗЩ-ЮУ, ЭЦШ ЮТЛХХГ ЦКЗЦХГОХ ВЫО ДИШЮ РШЪУЖ И ЧШЭЖФОНЮ, АО М ККЪБТ ЫЛЭЗУЛ, ЧЕ ОХЮЖХ ИЫЪЮДБЕЧШТ. ФЧ ПШЫБМТЛ МБЕЖМАЬМ Х ЧПМЖ ЗУЧШВ, ШСШККТЖ Т ЧИК, БЕВП ШШЧЧЛЯ ИШ ВЫХЯ О ЛЫЬМ ВВЙНЕЬ ЭЖРДШХ ХФЫКЪХДЛЧЬП. ЮА ХШЛШЦЫС ЫЕЛХ Х ШПЧПЭЫЛ ОЕЫПЕО ХЕЬ ББЧЬАМШЕВ ФАЩШЕЖХ ИС ЯТШТДПБТШТ ТЕБТЭ, Т УРХ РШШ БЕЫБ ШКК МХГУШ И ЧХБШЪАСШЯФ, ФАФ БЖКЖБК, ЯБШШМЭ ЗЕФ ЫКШАШЛ БИЧЮХУТК ЩЮЪЖЛУОХЕ НКГХПАЩЬЬ М ИХЛУЦКАДРЭЮ ЫТБЛНО ЧРКЖХЬЧШЭЖ, ЧЕРХЮО ЧЕЦХЙ ЦПШТВДЕ ЩЕЪХЯЛЧИЬМ ДИШЕ ЫЫБИШ. НТ Т ЭЖФОЦ БЮЩБАП ЭШ ЩМЕХШКОМАХ ЮА ЧМОТЕ ЫНОЕЪЦШР, Т ЕЫЫЫ ЬПНК ЭУ РКРЬЮЗЛХЬ ЫЫЫЮФОЦ ЯБКЧИЦРЮЖЫЬ ЩАБШТВ ШСОРЧОМХАУШГШ, ЮА УП ПЪШФЖМЛЙЫ АО ШДЧЮЬ РШППЩЭО, ЧО ЭЬШУЖШКЫ ЕФХЬФЮ ЭФХИБХДШМО, Т ЕБШЙ ОЫВУИКЛЫП ЫУШГОР АЛЫКШЫПРШ ГШЫБКЧЫЦ, ЭБ, ФОНКЪБ МП, ПЪШХБФАХ Ъ РШШМЭ. РЭРЭРКВАФЫТЖ ХЦФ ЩРШБЕОЪАХРДВ ОО ЬЮЦФ, БТШ ЮА ХШЛШЦЫС АЕХЮХЖЬЬ РХАЩ ЫВШО Х ЧЭТФШ АЛ ЛОХХШ КМУЯ АУН, К ЧЬЮФБ ФАФ-ЭЫЗЭДЖ ЭШ ХШЦПЫБИКТЖ ЫЫЮЧИУ АУН, ШН ЧШЭФНДК ЭШ РХАХ ЯШЦАУ ЛЮЮЛП ООЭБП ХОРХКРТ В ЫТБП ЫУЩ; ТВЦШЧПЬ, Х ИШСФАШЧЧЫУ ФШУЖ ЭЬЮ ВЦКВТЫБ УП ТКЪ ДШЪОНЮ ЫЧЩОХЭТСШСЖ, ЯБШШМЭ ЗЕФ ВИХЫШЦ МЫЩШХЖХ ТШУЧЖ ОВП СЖШЕЛФШ ВОМА Т ЮЧУЭ БЭВОСФУ ЬЬЫУЧОУ ТБКФИ, ФЮЕФЪУИ, ЮЧУККШ ЦШ, ФЧ ВЫХЦКК БЪРАОХ. ПТЫ БУ МОМБШ УП ТКЪ, ЭЖФ АЧУЮОБАЧША, РШТШАОП ЬОЬЗУЧ ЩОЫЫШ ФЛЕОР ЪЖЩИЪРШШ ОВПАП УК КЪОКФФ И ЧРГЛСЫМРШШЫЯ ШФЫУ. ЧАЩАБШТВ, ШЭ, ЭЖФ НПЬШЬ, ЩИХ ТДЛНДК ТЧФЯНШТШУЧО, ТЫЫ Ч ЫАЩЮЩУТКШЬ ЦФЮМКЭБТ, ТЛТ Б ДШШЛЙАБТ ФУЧЖБТ, ЬОРХ АЛЦЦПЬ Ы ЗШЛЖИЫТ ЩЬЙЭЫЬПЮ. ЬРЭФМ БЕЫ ИЖЪАФВШЦ ЛЛКУБЦШДЧЮЦФ ВИХЫШЦК, КШВБЦЕЙ ЧРЭФЧЕА СОС ЩРТТШКПН М ЗГЛСВЕЗУПЧО СРЕЦЭДЧШЕЛХЬЧЮШ ХШЛШЦШУТЕ. ЯЮЕЕ ШН ЛЛЮ ЪХЕНЬУШТК Т ЭШТПЦ, ШФАЖФО Р ЯБЧЬУЩЪЫ ХТРШУБИК ВШЧФЩОИХШ Х УПМ БВБ-ШШ ПШЕБМПЕ ЧР ГЛМНШБЕВ.";
            var v = new VigenereDecrypter(v14);

            var an = new VigenereAnalysis(v14);
            var pm = an.PossibleMus();

            an.SuggestMu(pm.First());
            an.SuggestMostOccuring(0, 'О');
            an.SuggestMostOccuring(1, 'О');
            an.SuggestMostOccuring(2, 'О');
            an.SuggestMostOccuring(3, 'О');
            an.SuggestMostOccuring(4, 'О');
            an.SuggestMostOccuring(5, 'О');

            var t1 = v.Text;
            v.Key = "КРУЖКА";

            var t = v.Text;
        }

        [Test]
        public void TestVar12()
        {
            var v12 =
                "Щ ЙУЧЙЧЙЗТОУ ЬСГКЩ ТС ЯБЩЦЫЪЕ ЖХЯГЛЬПГ ЦБВЕПД ЙЧЖЦХД ЪШУЧМДКБН ЮИКЖ ЯЬННЪ Г НЩУЩЮД ЖНГАИНЕЭЪ Ю ШЕГЪНЙУУНС ЩУБАОДНИЬЬМ. ЕЮХЗЯОВЬДЬ ЙЧАЙИА Щ ЖМЧТЗЕГИПЩЧ ЖЕПЩ ЪАКЧ ААА ЗШЫЕ Н ЩЗЦВБДТМЮД ЯЪ БААЯЧЦЭШИПЯЮП ЖУАЧУЬТЩР ЛЯЧЯЮТЧСЩ Ъ Н ЖХЩЭДОТЯР НЕРЩЦЙЕЦГОЪ ЯМЛСНДДПД ДГ, ЬГА ЮТЗЦГЖЯ ТСЦ ИЧИСЩДДЕЭЪ АЬРСРОИД ХЭЫ ЙУФА, УЙУТН ИЕЛЮА ЭТРЯ БКИХЦЦНЙЗЯЮ ДМ ШШЯЬЙБ, ИДК ДЕЖААЯЧВС Ю ИЕЭНС ГЕФТГЯТСЗ. ЯКЗЦВЙЧТГЬД, ШРЦЦЙТК ЭЪНИА Щ ВКЮУУНБ ИРСФЫДПЩ, ЪАКЧ УЧЗЯЬСФК ЖУШТАЯ ЦУАДМ РЦХБДБЫЪС, ЩКБДЗЦЗМЗ АЬЗИАЙЕП, АВДБЕШНЮЧД ЩЮ ЛЕЙЮЪИЧЧН ЯБИПЯЭШБУ УНФЬ ФЬЧУЕ Н ХЧМЭЕГОНЦ ФБСИЬК; ЫАМЕЬЦ ГЖЧМСДШ, Щ ВГА ЮЗКЭС ЙЬЗВЬДА ФБАНЖКЫД - ЛЬЙСХКЪНИЧНБНЪ ЯБЩЦЫЪЕ ЖХЯГЛЬПГ. ЯК ОКЭ УЗЯЛЦ Ь АЩШЭ ЙЬИЕЭ, ДБГ ШЭЧЙУЭСЧОИД ИЪНВУ ФЕЮЬХЮЧМЕЗ, АЧАЧИЯХКЩ Н ХЧОЬО: ЯЯД ДЕЫАЙЬЫ УНОЬЦЮСЪЙЦР ЯБЭТМЮД ЯЪ БААЯЧЦЭЫГН, ЩЦПРНЭЪ ЛЕЙ БЕЖК Ц ВФКЯСЩ ББИЧБНИЯ, ХСЩЙЕЫУЧОДАЭЪ, НВЕТАЙЬХУЯЧГН АААЗШФТИЯ. ССЭК-ЖУЭТЗК ФБЪНЕКХЪЙЦГГГЫ Б НЖ АЭРКВДЮК ЗВЧ, КБУЮЙДЩЭЩЧ АЕЗЯЭШДУ УТВДАЦ ЦКГЕЙЯДЬ МСЯЫЙНР, ЬЬБЧЯ: БКЪУУАМЯЗЙЪБ И ЦУАДГ ЙЯЬОЕХЯЮ К ЖУФААЬ Н Я ЯБШУЬОФЕС АВЧРНЫЧ, ЮИПЯЙДЩЭЦЮ ЙЧ ТЯГП, КМЮТЮПНЦ А ГЫУБАЮУК ЬАФЧЙЦЫ Д ЫКГЧЕ ИЗЯЪС, ЩФБАУЬС ААЖЧММФЬХЮЩЗ ЭЕРНКДЬ ЙСВКЩЕЮЪЫ, ЖХЯЙДЙЕУКДЬ ЕЕЪФК Н УТВДШП ГОЧЧНР Ю ЪЕШЧОЧЪ Я БМЯКШШЬХЮЩЗ Д ЕЧЛЧГЭЕПЛДМ, ТСЬКДКЗ ФЧЖНУКДМ ЬСКЖК ПЯЖДХ Н ИТЪ; Б ТЩЮ ЛЗНВАБЫНЮСЪЙЦР Ъ ОЬ, ПЯДКЗАЖ ЩЬЩНХЯЬЦ ЦДЦШШЕ ЮТАЬРЩЭЬ ШРСХКИРЯФБДТМЮ ГЩЕЮЪБГ ЬЩЯКЩТЩЬКЩ ФЯ АНЕЖЦЯЙТС ААМКЬЦЯДЦС. Ы ЯДГ ФБЪНЕКХЪЙЦГГГЫ Я ЧЦ, ЬКЙУБНБ ИРДШЬЙ З ЩЯКИЧБТЙДУЪ ЬКВРЦХДЯ Н ЯДЗЯЬСРОИД ТЭЬЪУБААИЧУАИ ИЗЯЪС ЮЕЮСОЯО Щ БМЯЗМЙББ. ЖЯШБ, БЕЫЪБ ЬЦГО ЛЗКЫВЬИТМЧ АЕРЧЯКИЧЩ Ъ НВШЧУЧ! БЕЫ АЙЯ ЗЯЩЮТЭСРО Я ШВЭЬЭЙСРО ЫШЙЕ! ЙЕ, ШУН! Ы ДК ВЭПЭШ Щ ЭДПКЮ ЕАЕЗЯЭШИЧУЪЫ ЩНХЧОУ ЧЯЯЖЕК ЯУМЧЮЦЯДЬ Ц ВАЭЕГ ЮТУЧРНЯДБУУ. ФНЬ, ЬГА ЮТ ТЩ ФНЙХЦДДЙК ЮТ ЙЬЗВЬКГ ФБАНЖКЫДБ, ЩЦЦ ЪНЖУЬЯБДУ АВДВНИЪЫ: ГШЧЙДДА У ЦЗЯТЮНС ИГБДПБЕЖ, Г ГЧРЯШБДТМЮД Щ ПСВИЧТМ ВПБЕЭЪ, ИЧСМ Ф МЕМЯФЧМ, ЖЦЭЧМ Н ТЭБЫТЯ-ХКВШТНС ЧЧЬТНДАЖ ВБЫНЮХКЙЕЖ Ъ ФВДАЬЬМ.";

            var an = new VigenereAnalysis(v12);
            var pm = an.PossibleMus();

            an.SuggestMu(pm.First());
            an.SuggestMostOccuring(0, 'Е');
            an.SuggestMostOccuring(1, 'А');
            an.SuggestMostOccuring(2, 'О');
            an.SuggestMostOccuring(3, 'О');
            an.SuggestMostOccuring(4, 'И');
        }
    }
}
